package ru.itmo.lessons.lesson20;

public class Task02 {
    public static void main(String[] args) {
        // Задания по классу Course из пакета package ru.itmo.lessons.lesson18.task

        // TODO 1: Создать map,
        //  где ключи - названия курсов,
        //  значения - списки курсов с указанным в ключе названием


        // TODO 2: Создать map,
        //  где ключи - продолжительность курсов,
        //  значения - списки курсов с указанной в ключе продолжительностью


        // TODO 3: Создать map, где ключи - названия курсов,
        //  значения - количество курсов с указанным в ключе названием


        // TODO 4: Создать map, где ключи - названия курсов,
        //  значения - map,
        //  в которой  ключи - продолжительность курса,
        //  а значения - списки курсов с указанной в ключе продолжительностью
    }
}
